MikroElektronika/core_packages/PIC/XC8/def/PIC16F1614/mcu.h
// Register: AT1CC2L
#define AT1CC2L AT1CC2L
extern volatile unsigned char           AT1CC2L             __at(0x893);
#ifndef _LIB_BUILD
asm("AT1CC2L equ 0893h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AT1CC20                :1;
        unsigned AT1CC21                :1;
        unsigned AT1CC22                :1;
        unsigned AT1CC23                :1;
        unsigned AT1CC24                :1;
        unsigned AT1CC25                :1;
        unsigned AT1CC26                :1;
        unsigned AT1CC27                :1;
    };
    struct {
        unsigned CC20                   :1;
        unsigned CC21                   :1;
        unsigned CC22                   :1;
        unsigned CC13                   :1;
        unsigned CC24                   :1;
        unsigned CCW5                   :1;
        unsigned CC26                   :1;
        unsigned CC27                   :1;
    };
} AT1CC2Lbits_t;
extern volatile AT1CC2Lbits_t AT1CC2Lbits __at(0x893);
// bitfield macros
#define _AT1CC2L_AT1CC20_POSN                               0x0
#define _AT1CC2L_AT1CC20_POSITION                           0x0
#define _AT1CC2L_AT1CC20_SIZE                               0x1
#define _AT1CC2L_AT1CC20_LENGTH                             0x1
#define _AT1CC2L_AT1CC20_MASK                               0x1
#define _AT1CC2L_AT1CC21_POSN                               0x1
#define _AT1CC2L_AT1CC21_POSITION                           0x1
#define _AT1CC2L_AT1CC21_SIZE                               0x1
#define _AT1CC2L_AT1CC21_LENGTH                             0x1
#define _AT1CC2L_AT1CC21_MASK                               0x2
#define _AT1CC2L_AT1CC22_POSN                               0x2
#define _AT1CC2L_AT1CC22_POSITION                           0x2
#define _AT1CC2L_AT1CC22_SIZE                               0x1
#define _AT1CC2L_AT1CC22_LENGTH                             0x1
#define _AT1CC2L_AT1CC22_MASK                               0x4
#define _AT1CC2L_AT1CC23_POSN                               0x3
#define _AT1CC2L_AT1CC23_POSITION                           0x3
#define _AT1CC2L_AT1CC23_SIZE                               0x1
#define _AT1CC2L_AT1CC23_LENGTH                             0x1
#define _AT1CC2L_AT1CC23_MASK                               0x8
#define _AT1CC2L_AT1CC24_POSN                               0x4
#define _AT1CC2L_AT1CC24_POSITION                           0x4
#define _AT1CC2L_AT1CC24_SIZE                               0x1
#define _AT1CC2L_AT1CC24_LENGTH                             0x1
#define _AT1CC2L_AT1CC24_MASK                               0x10
#define _AT1CC2L_AT1CC25_POSN                               0x5
#define _AT1CC2L_AT1CC25_POSITION                           0x5
#define _AT1CC2L_AT1CC25_SIZE                               0x1
#define _AT1CC2L_AT1CC25_LENGTH                             0x1
#define _AT1CC2L_AT1CC25_MASK                               0x20
#define _AT1CC2L_AT1CC26_POSN                               0x6
#define _AT1CC2L_AT1CC26_POSITION                           0x6
#define _AT1CC2L_AT1CC26_SIZE                               0x1
#define _AT1CC2L_AT1CC26_LENGTH                             0x1
#define _AT1CC2L_AT1CC26_MASK                               0x40
#define _AT1CC2L_AT1CC27_POSN                               0x7
#define _AT1CC2L_AT1CC27_POSITION                           0x7
#define _AT1CC2L_AT1CC27_SIZE                               0x1
#define _AT1CC2L_AT1CC27_LENGTH                             0x1
#define _AT1CC2L_AT1CC27_MASK                               0x80
#define _AT1CC2L_CC20_POSN                                  0x0
#define _AT1CC2L_CC20_POSITION                              0x0
#define _AT1CC2L_CC20_SIZE                                  0x1
#define _AT1CC2L_CC20_LENGTH                                0x1
#define _AT1CC2L_CC20_MASK                                  0x1
#define _AT1CC2L_CC21_POSN                                  0x1
#define _AT1CC2L_CC21_POSITION                              0x1
#define _AT1CC2L_CC21_SIZE                                  0x1
#define _AT1CC2L_CC21_LENGTH                                0x1
#define _AT1CC2L_CC21_MASK                                  0x2
#define _AT1CC2L_CC22_POSN                                  0x2
#define _AT1CC2L_CC22_POSITION                              0x2
#define _AT1CC2L_CC22_SIZE                                  0x1
#define _AT1CC2L_CC22_LENGTH                                0x1
#define _AT1CC2L_CC22_MASK                                  0x4
#define _AT1CC2L_CC13_POSN                                  0x3
#define _AT1CC2L_CC13_POSITION                              0x3
#define _AT1CC2L_CC13_SIZE                                  0x1
#define _AT1CC2L_CC13_LENGTH                                0x1
#define _AT1CC2L_CC13_MASK                                  0x8
#define _AT1CC2L_CC24_POSN                                  0x4
#define _AT1CC2L_CC24_POSITION                              0x4
#define _AT1CC2L_CC24_SIZE                                  0x1
#define _AT1CC2L_CC24_LENGTH                                0x1
#define _AT1CC2L_CC24_MASK                                  0x10
#define _AT1CC2L_CCW5_POSN                                  0x5
#define _AT1CC2L_CCW5_POSITION                              0x5
#define _AT1CC2L_CCW5_SIZE                                  0x1
#define _AT1CC2L_CCW5_LENGTH                                0x1
#define _AT1CC2L_CCW5_MASK                                  0x20
#define _AT1CC2L_CC26_POSN                                  0x6
#define _AT1CC2L_CC26_POSITION                              0x6
#define _AT1CC2L_CC26_SIZE                                  0x1
#define _AT1CC2L_CC26_LENGTH                                0x1
#define _AT1CC2L_CC26_MASK                                  0x40
#define _AT1CC2L_CC27_POSN                                  0x7
#define _AT1CC2L_CC27_POSITION                              0x7
#define _AT1CC2L_CC27_SIZE                                  0x1
#define _AT1CC2L_CC27_LENGTH                                0x1
#define _AT1CC2L_CC27_MASK                                  0x80

// Register: AT1CC2H
#define AT1CC2H AT1CC2H
extern volatile unsigned char           AT1CC2H             __at(0x894);
#ifndef _LIB_BUILD
asm("AT1CC2H equ 0894h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AT1CC28                :1;
        unsigned AT1CC29                :1;
    };
    struct {
        unsigned CC28                   :1;
        unsigned CC29                   :1;
    };
} AT1CC2Hbits_t;
