MikroElektronika/core_packages/PIC/XC8/def/PIC16F1614/mcu.h
#define                                 PERH4_bit           _BIT_ACCESS(AT1PERH,4)
// AT1PERH<PERH5>
extern volatile __bit                   PERH5               __at(0x408D);	// @ (0x811 * 8 + 5)
#define                                 PERH5_bit           _BIT_ACCESS(AT1PERH,5)
// AT1PERH<PERH6>
extern volatile __bit                   PERH6               __at(0x408E);	// @ (0x811 * 8 + 6)
#define                                 PERH6_bit           _BIT_ACCESS(AT1PERH,6)
// AT1PERH<PERH7>
extern volatile __bit                   PERH7               __at(0x408F);	// @ (0x811 * 8 + 7)
#define                                 PERH7_bit           _BIT_ACCESS(AT1PERH,7)
// AT1PERL<PERL0>
extern volatile __bit                   PERL0               __at(0x4080);	// @ (0x810 * 8 + 0)
#define                                 PERL0_bit           _BIT_ACCESS(AT1PERL,0)
// AT1PERL<PERL1>
extern volatile __bit                   PERL1               __at(0x4081);	// @ (0x810 * 8 + 1)
#define                                 PERL1_bit           _BIT_ACCESS(AT1PERL,1)
// AT1PERL<PERL2>
extern volatile __bit                   PERL2               __at(0x4082);	// @ (0x810 * 8 + 2)
#define                                 PERL2_bit           _BIT_ACCESS(AT1PERL,2)
// AT1PERL<PERL3>
extern volatile __bit                   PERL3               __at(0x4083);	// @ (0x810 * 8 + 3)
#define                                 PERL3_bit           _BIT_ACCESS(AT1PERL,3)
// AT1PERL<PERL4>
extern volatile __bit                   PERL4               __at(0x4084);	// @ (0x810 * 8 + 4)
#define                                 PERL4_bit           _BIT_ACCESS(AT1PERL,4)
// AT1PERL<PERL5>
extern volatile __bit                   PERL5               __at(0x4085);	// @ (0x810 * 8 + 5)
#define                                 PERL5_bit           _BIT_ACCESS(AT1PERL,5)
// AT1PERL<PERL6>
extern volatile __bit                   PERL6               __at(0x4086);	// @ (0x810 * 8 + 6)
#define                                 PERL6_bit           _BIT_ACCESS(AT1PERL,6)
// AT1PERL<PERL7>
extern volatile __bit                   PERL7               __at(0x4087);	// @ (0x810 * 8 + 7)
#define                                 PERL7_bit           _BIT_ACCESS(AT1PERL,7)
// AT1CON1<PHP>
extern volatile __bit                   PHP                 __at(0x40AE);	// @ (0x815 * 8 + 6)
#define                                 PHP_bit             _BIT_ACCESS(AT1CON1,6)
// AT1PHSL<PHS0>
extern volatile __bit                   PHS0                __at(0x4090);	// @ (0x812 * 8 + 0)
#define                                 PHS0_bit            _BIT_ACCESS(AT1PHSL,0)
// AT1PHSL<PHS1>
extern volatile __bit                   PHS1                __at(0x4091);	// @ (0x812 * 8 + 1)
#define                                 PHS1_bit            _BIT_ACCESS(AT1PHSL,1)
// AT1PHSL<PHS2>
extern volatile __bit                   PHS2                __at(0x4092);	// @ (0x812 * 8 + 2)
#define                                 PHS2_bit            _BIT_ACCESS(AT1PHSL,2)
// AT1PHSL<PHS3>
extern volatile __bit                   PHS3                __at(0x4093);	// @ (0x812 * 8 + 3)
#define                                 PHS3_bit            _BIT_ACCESS(AT1PHSL,3)
// AT1PHSL<PHS4>
extern volatile __bit                   PHS4                __at(0x4094);	// @ (0x812 * 8 + 4)
#define                                 PHS4_bit            _BIT_ACCESS(AT1PHSL,4)
// AT1PHSL<PHS5>
extern volatile __bit                   PHS5                __at(0x4095);	// @ (0x812 * 8 + 5)
#define                                 PHS5_bit            _BIT_ACCESS(AT1PHSL,5)
// AT1PHSL<PHS6>
extern volatile __bit                   PHS6                __at(0x4096);	// @ (0x812 * 8 + 6)
#define                                 PHS6_bit            _BIT_ACCESS(AT1PHSL,6)
// AT1PHSL<PHS7>
extern volatile __bit                   PHS7                __at(0x4097);	// @ (0x812 * 8 + 7)
#define                                 PHS7_bit            _BIT_ACCESS(AT1PHSL,7)
// AT1PHSH<PHS8>
extern volatile __bit                   PHS8                __at(0x4098);	// @ (0x813 * 8 + 0)
#define                                 PHS8_bit            _BIT_ACCESS(AT1PHSH,0)
// AT1PHSH<PHS9>
extern volatile __bit                   PHS9                __at(0x4099);	// @ (0x813 * 8 + 1)
#define                                 PHS9_bit            _BIT_ACCESS(AT1PHSH,1)
// AT1PHSH<PHSL8>
extern volatile __bit                   PHSL8               __at(0x4098);	// @ (0x813 * 8 + 0)
#define                                 PHSL8_bit           _BIT_ACCESS(AT1PHSH,0)
// AT1PHSH<PHSL9>
extern volatile __bit                   PHSL9               __at(0x4099);	// @ (0x813 * 8 + 1)
#define                                 PHSL9_bit           _BIT_ACCESS(AT1PHSH,1)
// PID1ACCLL<PID1ACC0>
extern volatile __bit                   PID1ACC0            __at(0x3078);	// @ (0x60F * 8 + 0)
#define                                 PID1ACC0_bit        _BIT_ACCESS(PID1ACCLL,0)
// PID1ACCLL<PID1ACC1>
extern volatile __bit                   PID1ACC1            __at(0x3079);	// @ (0x60F * 8 + 1)
#define                                 PID1ACC1_bit        _BIT_ACCESS(PID1ACCLL,1)
// PID1ACCLH<PID1ACC10>
extern volatile __bit                   PID1ACC10           __at(0x3082);	// @ (0x610 * 8 + 2)
#define                                 PID1ACC10_bit       _BIT_ACCESS(PID1ACCLH,2)
// PID1ACCLH<PID1ACC11>
extern volatile __bit                   PID1ACC11           __at(0x3083);	// @ (0x610 * 8 + 3)
#define                                 PID1ACC11_bit       _BIT_ACCESS(PID1ACCLH,3)
// PID1ACCLH<PID1ACC12>
extern volatile __bit                   PID1ACC12           __at(0x3084);	// @ (0x610 * 8 + 4)
#define                                 PID1ACC12_bit       _BIT_ACCESS(PID1ACCLH,4)
// PID1ACCLH<PID1ACC13>
extern volatile __bit                   PID1ACC13           __at(0x3085);	// @ (0x610 * 8 + 5)
#define                                 PID1ACC13_bit       _BIT_ACCESS(PID1ACCLH,5)
// PID1ACCLH<PID1ACC14>
extern volatile __bit                   PID1ACC14           __at(0x3086);	// @ (0x610 * 8 + 6)
#define                                 PID1ACC14_bit       _BIT_ACCESS(PID1ACCLH,6)
// PID1ACCLH<PID1ACC15>
extern volatile __bit                   PID1ACC15           __at(0x3087);	// @ (0x610 * 8 + 7)
#define                                 PID1ACC15_bit       _BIT_ACCESS(PID1ACCLH,7)
// PID1ACCHL<PID1ACC16>
extern volatile __bit                   PID1ACC16           __at(0x3088);	// @ (0x611 * 8 + 0)
#define                                 PID1ACC16_bit       _BIT_ACCESS(PID1ACCHL,0)
// PID1ACCHL<PID1ACC17>
extern volatile __bit                   PID1ACC17           __at(0x3089);	// @ (0x611 * 8 + 1)
#define                                 PID1ACC17_bit       _BIT_ACCESS(PID1ACCHL,1)
// PID1ACCHL<PID1ACC18>
extern volatile __bit                   PID1ACC18           __at(0x308A);	// @ (0x611 * 8 + 2)
#define                                 PID1ACC18_bit       _BIT_ACCESS(PID1ACCHL,2)
// PID1ACCHL<PID1ACC19>
extern volatile __bit                   PID1ACC19           __at(0x308B);	// @ (0x611 * 8 + 3)
#define                                 PID1ACC19_bit       _BIT_ACCESS(PID1ACCHL,3)
// PID1ACCLL<PID1ACC2>
extern volatile __bit                   PID1ACC2            __at(0x307A);	// @ (0x60F * 8 + 2)
#define                                 PID1ACC2_bit        _BIT_ACCESS(PID1ACCLL,2)
// PID1ACCHL<PID1ACC20>
extern volatile __bit                   PID1ACC20           __at(0x308C);	// @ (0x611 * 8 + 4)
#define                                 PID1ACC20_bit       _BIT_ACCESS(PID1ACCHL,4)
// PID1ACCHL<PID1ACC21>
extern volatile __bit                   PID1ACC21           __at(0x308D);	// @ (0x611 * 8 + 5)
#define                                 PID1ACC21_bit       _BIT_ACCESS(PID1ACCHL,5)
// PID1ACCHL<PID1ACC22>
extern volatile __bit                   PID1ACC22           __at(0x308E);	// @ (0x611 * 8 + 6)
#define                                 PID1ACC22_bit       _BIT_ACCESS(PID1ACCHL,6)
// PID1ACCHL<PID1ACC23>
extern volatile __bit                   PID1ACC23           __at(0x308F);	// @ (0x611 * 8 + 7)
#define                                 PID1ACC23_bit       _BIT_ACCESS(PID1ACCHL,7)
// PID1ACCHH<PID1ACC24>
extern volatile __bit                   PID1ACC24           __at(0x3090);	// @ (0x612 * 8 + 0)
#define                                 PID1ACC24_bit       _BIT_ACCESS(PID1ACCHH,0)
// PID1ACCHH<PID1ACC25>
extern volatile __bit                   PID1ACC25           __at(0x3091);	// @ (0x612 * 8 + 1)
#define                                 PID1ACC25_bit       _BIT_ACCESS(PID1ACCHH,1)
// PID1ACCHH<PID1ACC26>
extern volatile __bit                   PID1ACC26           __at(0x3092);	// @ (0x612 * 8 + 2)
#define                                 PID1ACC26_bit       _BIT_ACCESS(PID1ACCHH,2)
// PID1ACCHH<PID1ACC27>
extern volatile __bit                   PID1ACC27           __at(0x3093);	// @ (0x612 * 8 + 3)
#define                                 PID1ACC27_bit       _BIT_ACCESS(PID1ACCHH,3)
// PID1ACCHH<PID1ACC28>
extern volatile __bit                   PID1ACC28           __at(0x3094);	// @ (0x612 * 8 + 4)
#define                                 PID1ACC28_bit       _BIT_ACCESS(PID1ACCHH,4)
// PID1ACCHH<PID1ACC29>
extern volatile __bit                   PID1ACC29           __at(0x3095);	// @ (0x612 * 8 + 5)
#define                                 PID1ACC29_bit       _BIT_ACCESS(PID1ACCHH,5)
// PID1ACCLL<PID1ACC3>
extern volatile __bit                   PID1ACC3            __at(0x307B);	// @ (0x60F * 8 + 3)
#define                                 PID1ACC3_bit        _BIT_ACCESS(PID1ACCLL,3)
// PID1ACCHH<PID1ACC30>
extern volatile __bit                   PID1ACC30           __at(0x3096);	// @ (0x612 * 8 + 6)
#define                                 PID1ACC30_bit       _BIT_ACCESS(PID1ACCHH,6)
// PID1ACCHH<PID1ACC31>
extern volatile __bit                   PID1ACC31           __at(0x3097);	// @ (0x612 * 8 + 7)
#define                                 PID1ACC31_bit       _BIT_ACCESS(PID1ACCHH,7)
// PID1ACCU<PID1ACC32>
extern volatile __bit                   PID1ACC32           __at(0x3098);	// @ (0x613 * 8 + 0)
#define                                 PID1ACC32_bit       _BIT_ACCESS(PID1ACCU,0)
// PID1ACCU<PID1ACC33>
extern volatile __bit                   PID1ACC33           __at(0x3099);	// @ (0x613 * 8 + 1)
#define                                 PID1ACC33_bit       _BIT_ACCESS(PID1ACCU,1)
// PID1ACCU<PID1ACC34>
extern volatile __bit                   PID1ACC34           __at(0x309A);	// @ (0x613 * 8 + 2)
#define                                 PID1ACC34_bit       _BIT_ACCESS(PID1ACCU,2)
// PID1ACCLL<PID1ACC4>
extern volatile __bit                   PID1ACC4            __at(0x307C);	// @ (0x60F * 8 + 4)
#define                                 PID1ACC4_bit        _BIT_ACCESS(PID1ACCLL,4)
// PID1ACCLL<PID1ACC5>
extern volatile __bit                   PID1ACC5            __at(0x307D);	// @ (0x60F * 8 + 5)
#define                                 PID1ACC5_bit        _BIT_ACCESS(PID1ACCLL,5)
// PID1ACCLL<PID1ACC6>
extern volatile __bit                   PID1ACC6            __at(0x307E);	// @ (0x60F * 8 + 6)
#define                                 PID1ACC6_bit        _BIT_ACCESS(PID1ACCLL,6)
// PID1ACCLL<PID1ACC7>
extern volatile __bit                   PID1ACC7            __at(0x307F);	// @ (0x60F * 8 + 7)
#define                                 PID1ACC7_bit        _BIT_ACCESS(PID1ACCLL,7)
// PID1ACCLH<PID1ACC8>
extern volatile __bit                   PID1ACC8            __at(0x3080);	// @ (0x610 * 8 + 0)
#define                                 PID1ACC8_bit        _BIT_ACCESS(PID1ACCLH,0)
// PID1ACCLH<PID1ACC9>
extern volatile __bit                   PID1ACC9            __at(0x3081);	// @ (0x610 * 8 + 1)
#define                                 PID1ACC9_bit        _BIT_ACCESS(PID1ACCLH,1)
// PID1CON<PID1BUSY>
extern volatile __bit                   PID1BUSY            __at(0x30A6);	// @ (0x614 * 8 + 6)
#define                                 PID1BUSY_bit        _BIT_ACCESS(PID1CON,6)
// PIE5<PID1DIE>
extern volatile __bit                   PID1DIE             __at(0x4A0);	// @ (0x94 * 8 + 0)
#define                                 PID1DIE_bit         _BIT_ACCESS(PIE5,0)
// PIR5<PID1DIF>
extern volatile __bit                   PID1DIF             __at(0xA0);	// @ (0x14 * 8 + 0)
#define                                 PID1DIF_bit         _BIT_ACCESS(PIR5,0)
// PIE5<PID1EIE>
extern volatile __bit                   PID1EIE             __at(0x4A1);	// @ (0x94 * 8 + 1)
#define                                 PID1EIE_bit         _BIT_ACCESS(PIE5,1)
// PIR5<PID1EIF>
extern volatile __bit                   PID1EIF             __at(0xA1);	// @ (0x14 * 8 + 1)
#define                                 PID1EIF_bit         _BIT_ACCESS(PIR5,1)
// PID1CON<PID1EN>
extern volatile __bit                   PID1EN              __at(0x30A7);	// @ (0x614 * 8 + 7)
#define                                 PID1EN_bit          _BIT_ACCESS(PID1CON,7)
// PID1INL<PID1IN0>
extern volatile __bit                   PID1IN0             __at(0x2C70);	// @ (0x58E * 8 + 0)
#define                                 PID1IN0_bit         _BIT_ACCESS(PID1INL,0)
// PID1INL<PID1IN1>
extern volatile __bit                   PID1IN1             __at(0x2C71);	// @ (0x58E * 8 + 1)
#define                                 PID1IN1_bit         _BIT_ACCESS(PID1INL,1)
// PID1INH<PID1IN10>
extern volatile __bit                   PID1IN10            __at(0x2C7A);	// @ (0x58F * 8 + 2)
#define                                 PID1IN10_bit        _BIT_ACCESS(PID1INH,2)
// PID1INH<PID1IN11>
extern volatile __bit                   PID1IN11            __at(0x2C7B);	// @ (0x58F * 8 + 3)
#define                                 PID1IN11_bit        _BIT_ACCESS(PID1INH,3)
// PID1INH<PID1IN12>
extern volatile __bit                   PID1IN12            __at(0x2C7C);	// @ (0x58F * 8 + 4)
#define                                 PID1IN12_bit        _BIT_ACCESS(PID1INH,4)
// PID1INH<PID1IN13>
extern volatile __bit                   PID1IN13            __at(0x2C7D);	// @ (0x58F * 8 + 5)
#define                                 PID1IN13_bit        _BIT_ACCESS(PID1INH,5)
// PID1INH<PID1IN14>
extern volatile __bit                   PID1IN14            __at(0x2C7E);	// @ (0x58F * 8 + 6)
#define                                 PID1IN14_bit        _BIT_ACCESS(PID1INH,6)
// PID1INH<PID1IN15>
extern volatile __bit                   PID1IN15            __at(0x2C7F);	// @ (0x58F * 8 + 7)
#define                                 PID1IN15_bit        _BIT_ACCESS(PID1INH,7)
// PID1INL<PID1IN2>
extern volatile __bit                   PID1IN2             __at(0x2C72);	// @ (0x58E * 8 + 2)
#define                                 PID1IN2_bit         _BIT_ACCESS(PID1INL,2)
// PID1INL<PID1IN3>
extern volatile __bit                   PID1IN3             __at(0x2C73);	// @ (0x58E * 8 + 3)
#define                                 PID1IN3_bit         _BIT_ACCESS(PID1INL,3)
// PID1INL<PID1IN4>
extern volatile __bit                   PID1IN4             __at(0x2C74);	// @ (0x58E * 8 + 4)
#define                                 PID1IN4_bit         _BIT_ACCESS(PID1INL,4)
// PID1INL<PID1IN5>
extern volatile __bit                   PID1IN5             __at(0x2C75);	// @ (0x58E * 8 + 5)
#define                                 PID1IN5_bit         _BIT_ACCESS(PID1INL,5)
// PID1INL<PID1IN6>
extern volatile __bit                   PID1IN6             __at(0x2C76);	// @ (0x58E * 8 + 6)
#define                                 PID1IN6_bit         _BIT_ACCESS(PID1INL,6)
// PID1INL<PID1IN7>
extern volatile __bit                   PID1IN7             __at(0x2C77);	// @ (0x58E * 8 + 7)
#define                                 PID1IN7_bit         _BIT_ACCESS(PID1INL,7)
// PID1INH<PID1IN8>
extern volatile __bit                   PID1IN8             __at(0x2C78);	// @ (0x58F * 8 + 0)
#define                                 PID1IN8_bit         _BIT_ACCESS(PID1INH,0)
// PID1INH<PID1IN9>
extern volatile __bit                   PID1IN9             __at(0x2C79);	// @ (0x58F * 8 + 1)
#define                                 PID1IN9_bit         _BIT_ACCESS(PID1INH,1)
// PID1K1L<PID1K10>
extern volatile __bit                   PID1K10             __at(0x2C80);	// @ (0x590 * 8 + 0)
#define                                 PID1K10_bit         _BIT_ACCESS(PID1K1L,0)
// PID1K1L<PID1K11>
extern volatile __bit                   PID1K11             __at(0x2C81);	// @ (0x590 * 8 + 1)
#define                                 PID1K11_bit         _BIT_ACCESS(PID1K1L,1)
// PID1K1H<PID1K110>
extern volatile __bit                   PID1K110            __at(0x2C8A);	// @ (0x591 * 8 + 2)
#define                                 PID1K110_bit        _BIT_ACCESS(PID1K1H,2)
// PID1K1H<PID1K111>
extern volatile __bit                   PID1K111            __at(0x2C8B);	// @ (0x591 * 8 + 3)
#define                                 PID1K111_bit        _BIT_ACCESS(PID1K1H,3)
// PID1K1H<PID1K112>
extern volatile __bit                   PID1K112            __at(0x2C8C);	// @ (0x591 * 8 + 4)
#define                                 PID1K112_bit        _BIT_ACCESS(PID1K1H,4)
// PID1K1H<PID1K113>
extern volatile __bit                   PID1K113            __at(0x2C8D);	// @ (0x591 * 8 + 5)
#define                                 PID1K113_bit        _BIT_ACCESS(PID1K1H,5)
// PID1K1H<PID1K114>
extern volatile __bit                   PID1K114            __at(0x2C8E);	// @ (0x591 * 8 + 6)
#define                                 PID1K114_bit        _BIT_ACCESS(PID1K1H,6)
// PID1K1H<PID1K115>
extern volatile __bit                   PID1K115            __at(0x2C8F);	// @ (0x591 * 8 + 7)
#define                                 PID1K115_bit        _BIT_ACCESS(PID1K1H,7)
// PID1K1L<PID1K12>
extern volatile __bit                   PID1K12             __at(0x2C82);	// @ (0x590 * 8 + 2)
#define                                 PID1K12_bit         _BIT_ACCESS(PID1K1L,2)
// PID1K1L<PID1K13>
extern volatile __bit                   PID1K13             __at(0x2C83);	// @ (0x590 * 8 + 3)
#define                                 PID1K13_bit         _BIT_ACCESS(PID1K1L,3)
// PID1K1L<PID1K14>
extern volatile __bit                   PID1K14             __at(0x2C84);	// @ (0x590 * 8 + 4)
#define                                 PID1K14_bit         _BIT_ACCESS(PID1K1L,4)
// PID1K1L<PID1K15>
extern volatile __bit                   PID1K15             __at(0x2C85);	// @ (0x590 * 8 + 5)
#define                                 PID1K15_bit         _BIT_ACCESS(PID1K1L,5)
// PID1K1L<PID1K16>
extern volatile __bit                   PID1K16             __at(0x2C86);	// @ (0x590 * 8 + 6)
#define                                 PID1K16_bit         _BIT_ACCESS(PID1K1L,6)
// PID1K1L<PID1K17>
extern volatile __bit                   PID1K17             __at(0x2C87);	// @ (0x590 * 8 + 7)
#define                                 PID1K17_bit         _BIT_ACCESS(PID1K1L,7)
// PID1K1H<PID1K18>
extern volatile __bit                   PID1K18             __at(0x2C88);	// @ (0x591 * 8 + 0)
#define                                 PID1K18_bit         _BIT_ACCESS(PID1K1H,0)
// PID1K1H<PID1K19>
extern volatile __bit                   PID1K19             __at(0x2C89);	// @ (0x591 * 8 + 1)
#define                                 PID1K19_bit         _BIT_ACCESS(PID1K1H,1)
// PID1K2L<PID1K20>
extern volatile __bit                   PID1K20             __at(0x2C90);	// @ (0x592 * 8 + 0)
#define                                 PID1K20_bit         _BIT_ACCESS(PID1K2L,0)
// PID1K2L<PID1K21>
extern volatile __bit                   PID1K21             __at(0x2C91);	// @ (0x592 * 8 + 1)
#define                                 PID1K21_bit         _BIT_ACCESS(PID1K2L,1)
// PID1K2H<PID1K210>
extern volatile __bit                   PID1K210            __at(0x2C9A);	// @ (0x593 * 8 + 2)
#define                                 PID1K210_bit        _BIT_ACCESS(PID1K2H,2)
// PID1K2H<PID1K211>
extern volatile __bit                   PID1K211            __at(0x2C9B);	// @ (0x593 * 8 + 3)
#define                                 PID1K211_bit        _BIT_ACCESS(PID1K2H,3)
// PID1K2H<PID1K212>
extern volatile __bit                   PID1K212            __at(0x2C9C);	// @ (0x593 * 8 + 4)
#define                                 PID1K212_bit        _BIT_ACCESS(PID1K2H,4)
// PID1K2H<PID1K213>
extern volatile __bit                   PID1K213            __at(0x2C9D);	// @ (0x593 * 8 + 5)
#define                                 PID1K213_bit        _BIT_ACCESS(PID1K2H,5)
// PID1K2H<PID1K214>
extern volatile __bit                   PID1K214            __at(0x2C9E);	// @ (0x593 * 8 + 6)
#define                                 PID1K214_bit        _BIT_ACCESS(PID1K2H,6)
// PID1K2H<PID1K215>
extern volatile __bit                   PID1K215            __at(0x2C9F);	// @ (0x593 * 8 + 7)
#define                                 PID1K215_bit        _BIT_ACCESS(PID1K2H,7)
// PID1K2L<PID1K22>
extern volatile __bit                   PID1K22             __at(0x2C92);	// @ (0x592 * 8 + 2)
#define                                 PID1K22_bit         _BIT_ACCESS(PID1K2L,2)
// PID1K2L<PID1K23>
extern volatile __bit                   PID1K23             __at(0x2C93);	// @ (0x592 * 8 + 3)
#define                                 PID1K23_bit         _BIT_ACCESS(PID1K2L,3)
// PID1K2L<PID1K24>
extern volatile __bit                   PID1K24             __at(0x2C94);	// @ (0x592 * 8 + 4)
#define                                 PID1K24_bit         _BIT_ACCESS(PID1K2L,4)
// PID1K2L<PID1K25>
extern volatile __bit                   PID1K25             __at(0x2C95);	// @ (0x592 * 8 + 5)
#define                                 PID1K25_bit         _BIT_ACCESS(PID1K2L,5)
// PID1K2L<PID1K26>
extern volatile __bit                   PID1K26             __at(0x2C96);	// @ (0x592 * 8 + 6)
#define                                 PID1K26_bit         _BIT_ACCESS(PID1K2L,6)
// PID1K2L<PID1K27>
extern volatile __bit                   PID1K27             __at(0x2C97);	// @ (0x592 * 8 + 7)
#define                                 PID1K27_bit         _BIT_ACCESS(PID1K2L,7)
// PID1K2H<PID1K28>
extern volatile __bit                   PID1K28             __at(0x2C98);	// @ (0x593 * 8 + 0)
#define                                 PID1K28_bit         _BIT_ACCESS(PID1K2H,0)
// PID1K2H<PID1K29>
extern volatile __bit                   PID1K29             __at(0x2C99);	// @ (0x593 * 8 + 1)
#define                                 PID1K29_bit         _BIT_ACCESS(PID1K2H,1)
// PID1K3L<PID1K30>
extern volatile __bit                   PID1K30             __at(0x2CA0);	// @ (0x594 * 8 + 0)
#define                                 PID1K30_bit         _BIT_ACCESS(PID1K3L,0)
// PID1K3L<PID1K31>
extern volatile __bit                   PID1K31             __at(0x2CA1);	// @ (0x594 * 8 + 1)
#define                                 PID1K31_bit         _BIT_ACCESS(PID1K3L,1)
// PID1K3H<PID1K310>
extern volatile __bit                   PID1K310            __at(0x2CAA);	// @ (0x595 * 8 + 2)
#define                                 PID1K310_bit        _BIT_ACCESS(PID1K3H,2)
// PID1K3H<PID1K311>
extern volatile __bit                   PID1K311            __at(0x2CAB);	// @ (0x595 * 8 + 3)
#define                                 PID1K311_bit        _BIT_ACCESS(PID1K3H,3)
// PID1K3H<PID1K312>
extern volatile __bit                   PID1K312            __at(0x2CAC);	// @ (0x595 * 8 + 4)
#define                                 PID1K312_bit        _BIT_ACCESS(PID1K3H,4)
// PID1K3H<PID1K313>
extern volatile __bit                   PID1K313            __at(0x2CAD);	// @ (0x595 * 8 + 5)
#define                                 PID1K313_bit        _BIT_ACCESS(PID1K3H,5)
// PID1K3H<PID1K314>
extern volatile __bit                   PID1K314            __at(0x2CAE);	// @ (0x595 * 8 + 6)
#define                                 PID1K314_bit        _BIT_ACCESS(PID1K3H,6)
// PID1K3H<PID1K315>
