MikroElektronika/core_packages/PIC/XC8/def/PIC16F1614/mcu.h
extern volatile __bit                   SMT2TMR3            __at(0x6CF3);	// @ (0xD9E * 8 + 3)
#define                                 SMT2TMR3_bit        _BIT_ACCESS(SMT2TMRL,3)
// SMT2TMRL<SMT2TMR4>
extern volatile __bit                   SMT2TMR4            __at(0x6CF4);	// @ (0xD9E * 8 + 4)
#define                                 SMT2TMR4_bit        _BIT_ACCESS(SMT2TMRL,4)
// SMT2TMRL<SMT2TMR5>
extern volatile __bit                   SMT2TMR5            __at(0x6CF5);	// @ (0xD9E * 8 + 5)
#define                                 SMT2TMR5_bit        _BIT_ACCESS(SMT2TMRL,5)
// SMT2TMRL<SMT2TMR6>
extern volatile __bit                   SMT2TMR6            __at(0x6CF6);	// @ (0xD9E * 8 + 6)
#define                                 SMT2TMR6_bit        _BIT_ACCESS(SMT2TMRL,6)
// SMT2TMRL<SMT2TMR7>
extern volatile __bit                   SMT2TMR7            __at(0x6CF7);	// @ (0xD9E * 8 + 7)
#define                                 SMT2TMR7_bit        _BIT_ACCESS(SMT2TMRL,7)
// SMT2TMRH<SMT2TMR8>
extern volatile __bit                   SMT2TMR8            __at(0x6CF8);	// @ (0xD9F * 8 + 0)
#define                                 SMT2TMR8_bit        _BIT_ACCESS(SMT2TMRH,0)
// SMT2TMRH<SMT2TMR9>
extern volatile __bit                   SMT2TMR9            __at(0x6CF9);	// @ (0xD9F * 8 + 1)
#define                                 SMT2TMR9_bit        _BIT_ACCESS(SMT2TMRH,1)
// SMT2STAT<SMT2TS>
extern volatile __bit                   SMT2TS              __at(0x6D62);	// @ (0xDAC * 8 + 2)
#define                                 SMT2TS_bit          _BIT_ACCESS(SMT2STAT,2)
// SMT2WINPPS<SMT2WINPPS0>
extern volatile __bit                   SMT2WINPPS0         __at(0x7168);	// @ (0xE2D * 8 + 0)
#define                                 SMT2WINPPS0_bit     _BIT_ACCESS(SMT2WINPPS,0)
// SMT2WINPPS<SMT2WINPPS1>
extern volatile __bit                   SMT2WINPPS1         __at(0x7169);	// @ (0xE2D * 8 + 1)
#define                                 SMT2WINPPS1_bit     _BIT_ACCESS(SMT2WINPPS,1)
// SMT2WINPPS<SMT2WINPPS2>
extern volatile __bit                   SMT2WINPPS2         __at(0x716A);	// @ (0xE2D * 8 + 2)
#define                                 SMT2WINPPS2_bit     _BIT_ACCESS(SMT2WINPPS,2)
// SMT2WINPPS<SMT2WINPPS3>
extern volatile __bit                   SMT2WINPPS3         __at(0x716B);	// @ (0xE2D * 8 + 3)
#define                                 SMT2WINPPS3_bit     _BIT_ACCESS(SMT2WINPPS,3)
// SMT2WINPPS<SMT2WINPPS4>
extern volatile __bit                   SMT2WINPPS4         __at(0x716C);	// @ (0xE2D * 8 + 4)
#define                                 SMT2WINPPS4_bit     _BIT_ACCESS(SMT2WINPPS,4)
// SMT2STAT<SMT2WS>
extern volatile __bit                   SMT2WS              __at(0x6D61);	// @ (0xDAC * 8 + 1)
#define                                 SMT2WS_bit          _BIT_ACCESS(SMT2STAT,1)
// SMT2WIN<SMT2WSEL0>
extern volatile __bit                   SMT2WSEL0           __at(0x6D78);	// @ (0xDAF * 8 + 0)
#define                                 SMT2WSEL0_bit       _BIT_ACCESS(SMT2WIN,0)
// SMT2WIN<SMT2WSEL1>
extern volatile __bit                   SMT2WSEL1           __at(0x6D79);	// @ (0xDAF * 8 + 1)
#define                                 SMT2WSEL1_bit       _BIT_ACCESS(SMT2WIN,1)
// SMT2WIN<SMT2WSEL2>
extern volatile __bit                   SMT2WSEL2           __at(0x6D7A);	// @ (0xDAF * 8 + 2)
#define                                 SMT2WSEL2_bit       _BIT_ACCESS(SMT2WIN,2)
// SMT2WIN<SMT2WSEL3>
extern volatile __bit                   SMT2WSEL3           __at(0x6D7B);	// @ (0xDAF * 8 + 3)
#define                                 SMT2WSEL3_bit       _BIT_ACCESS(SMT2WIN,3)
// SMT2WIN<SMT2WSEL4>
extern volatile __bit                   SMT2WSEL4           __at(0x6D7C);	// @ (0xDAF * 8 + 4)
#define                                 SMT2WSEL4_bit       _BIT_ACCESS(SMT2WIN,4)
// SMT1WINPPS<SMTWINPPS0>
extern volatile __bit                   SMTWINPPS0          __at(0x7138);	// @ (0xE27 * 8 + 0)
#define                                 SMTWINPPS0_bit      _BIT_ACCESS(SMT1WINPPS,0)
// SMT1WINPPS<SMTWINPPS1>
extern volatile __bit                   SMTWINPPS1          __at(0x7139);	// @ (0xE27 * 8 + 1)
#define                                 SMTWINPPS1_bit      _BIT_ACCESS(SMT1WINPPS,1)
// SMT1WINPPS<SMTWINPPS2>
extern volatile __bit                   SMTWINPPS2          __at(0x713A);	// @ (0xE27 * 8 + 2)
#define                                 SMTWINPPS2_bit      _BIT_ACCESS(SMT1WINPPS,2)
// SMT1WINPPS<SMTWINPPS3>
extern volatile __bit                   SMTWINPPS3          __at(0x713B);	// @ (0xE27 * 8 + 3)
#define                                 SMTWINPPS3_bit      _BIT_ACCESS(SMT1WINPPS,3)
// SMT1WINPPS<SMTWINPPS4>
extern volatile __bit                   SMTWINPPS4          __at(0x713C);	// @ (0xE27 * 8 + 4)
#define                                 SMTWINPPS4_bit      _BIT_ACCESS(SMT1WINPPS,4)
// RC1STA<SPEN>
extern volatile __bit                   SPEN                __at(0xCEF);	// @ (0x19D * 8 + 7)
#define                                 SPEN_bit            _BIT_ACCESS(RC1STA,7)
// OSCCON<SPLLEN>
extern volatile __bit                   SPLLEN              __at(0x4CF);	// @ (0x99 * 8 + 7)
#define                                 SPLLEN_bit          _BIT_ACCESS(OSCCON,7)
// RC1STA<SREN>
extern volatile __bit                   SREN                __at(0xCED);	// @ (0x19D * 8 + 5)
#define                                 SREN_bit            _BIT_ACCESS(RC1STA,5)
// SSP1ADD<SSP1ADD0>
extern volatile __bit                   SSP1ADD0            __at(0x1090);	// @ (0x212 * 8 + 0)
#define                                 SSP1ADD0_bit        _BIT_ACCESS(SSP1ADD,0)
// SSP1ADD<SSP1ADD1>
extern volatile __bit                   SSP1ADD1            __at(0x1091);	// @ (0x212 * 8 + 1)
#define                                 SSP1ADD1_bit        _BIT_ACCESS(SSP1ADD,1)
// SSP1ADD<SSP1ADD2>
extern volatile __bit                   SSP1ADD2            __at(0x1092);	// @ (0x212 * 8 + 2)
#define                                 SSP1ADD2_bit        _BIT_ACCESS(SSP1ADD,2)
// SSP1ADD<SSP1ADD3>
extern volatile __bit                   SSP1ADD3            __at(0x1093);	// @ (0x212 * 8 + 3)
#define                                 SSP1ADD3_bit        _BIT_ACCESS(SSP1ADD,3)
// SSP1ADD<SSP1ADD4>
extern volatile __bit                   SSP1ADD4            __at(0x1094);	// @ (0x212 * 8 + 4)
#define                                 SSP1ADD4_bit        _BIT_ACCESS(SSP1ADD,4)
// SSP1ADD<SSP1ADD5>
extern volatile __bit                   SSP1ADD5            __at(0x1095);	// @ (0x212 * 8 + 5)
#define                                 SSP1ADD5_bit        _BIT_ACCESS(SSP1ADD,5)
// SSP1ADD<SSP1ADD6>
extern volatile __bit                   SSP1ADD6            __at(0x1096);	// @ (0x212 * 8 + 6)
#define                                 SSP1ADD6_bit        _BIT_ACCESS(SSP1ADD,6)
// SSP1ADD<SSP1ADD7>
extern volatile __bit                   SSP1ADD7            __at(0x1097);	// @ (0x212 * 8 + 7)
#define                                 SSP1ADD7_bit        _BIT_ACCESS(SSP1ADD,7)
// SSP1BUF<SSP1BUF0>
extern volatile __bit                   SSP1BUF0            __at(0x1088);	// @ (0x211 * 8 + 0)
#define                                 SSP1BUF0_bit        _BIT_ACCESS(SSP1BUF,0)
// SSP1BUF<SSP1BUF1>
extern volatile __bit                   SSP1BUF1            __at(0x1089);	// @ (0x211 * 8 + 1)
#define                                 SSP1BUF1_bit        _BIT_ACCESS(SSP1BUF,1)
// SSP1BUF<SSP1BUF2>
extern volatile __bit                   SSP1BUF2            __at(0x108A);	// @ (0x211 * 8 + 2)
#define                                 SSP1BUF2_bit        _BIT_ACCESS(SSP1BUF,2)
// SSP1BUF<SSP1BUF3>
extern volatile __bit                   SSP1BUF3            __at(0x108B);	// @ (0x211 * 8 + 3)
#define                                 SSP1BUF3_bit        _BIT_ACCESS(SSP1BUF,3)
// SSP1BUF<SSP1BUF4>
extern volatile __bit                   SSP1BUF4            __at(0x108C);	// @ (0x211 * 8 + 4)
#define                                 SSP1BUF4_bit        _BIT_ACCESS(SSP1BUF,4)
// SSP1BUF<SSP1BUF5>
extern volatile __bit                   SSP1BUF5            __at(0x108D);	// @ (0x211 * 8 + 5)
#define                                 SSP1BUF5_bit        _BIT_ACCESS(SSP1BUF,5)
// SSP1BUF<SSP1BUF6>
extern volatile __bit                   SSP1BUF6            __at(0x108E);	// @ (0x211 * 8 + 6)
#define                                 SSP1BUF6_bit        _BIT_ACCESS(SSP1BUF,6)
// SSP1BUF<SSP1BUF7>
extern volatile __bit                   SSP1BUF7            __at(0x108F);	// @ (0x211 * 8 + 7)
#define                                 SSP1BUF7_bit        _BIT_ACCESS(SSP1BUF,7)
// PIE1<SSP1IE>
extern volatile __bit                   SSP1IE              __at(0x483);	// @ (0x90 * 8 + 3)
#define                                 SSP1IE_bit          _BIT_ACCESS(PIE1,3)
// PIR1<SSP1IF>
extern volatile __bit                   SSP1IF              __at(0x83);	// @ (0x10 * 8 + 3)
#define                                 SSP1IF_bit          _BIT_ACCESS(PIR1,3)
// SSP1MSK<SSP1MSK0>
extern volatile __bit                   SSP1MSK0            __at(0x1098);	// @ (0x213 * 8 + 0)
#define                                 SSP1MSK0_bit        _BIT_ACCESS(SSP1MSK,0)
// SSP1MSK<SSP1MSK1>
extern volatile __bit                   SSP1MSK1            __at(0x1099);	// @ (0x213 * 8 + 1)
#define                                 SSP1MSK1_bit        _BIT_ACCESS(SSP1MSK,1)
// SSP1MSK<SSP1MSK2>
extern volatile __bit                   SSP1MSK2            __at(0x109A);	// @ (0x213 * 8 + 2)
#define                                 SSP1MSK2_bit        _BIT_ACCESS(SSP1MSK,2)
// SSP1MSK<SSP1MSK3>
extern volatile __bit                   SSP1MSK3            __at(0x109B);	// @ (0x213 * 8 + 3)
#define                                 SSP1MSK3_bit        _BIT_ACCESS(SSP1MSK,3)
// SSP1MSK<SSP1MSK4>
extern volatile __bit                   SSP1MSK4            __at(0x109C);	// @ (0x213 * 8 + 4)
#define                                 SSP1MSK4_bit        _BIT_ACCESS(SSP1MSK,4)
// SSP1MSK<SSP1MSK5>
extern volatile __bit                   SSP1MSK5            __at(0x109D);	// @ (0x213 * 8 + 5)
#define                                 SSP1MSK5_bit        _BIT_ACCESS(SSP1MSK,5)
// SSP1MSK<SSP1MSK6>
extern volatile __bit                   SSP1MSK6            __at(0x109E);	// @ (0x213 * 8 + 6)
#define                                 SSP1MSK6_bit        _BIT_ACCESS(SSP1MSK,6)
// SSP1MSK<SSP1MSK7>
extern volatile __bit                   SSP1MSK7            __at(0x109F);	// @ (0x213 * 8 + 7)
#define                                 SSP1MSK7_bit        _BIT_ACCESS(SSP1MSK,7)
// SSPCLKPPS<SSPCLKPPS0>
extern volatile __bit                   SSPCLKPPS0          __at(0x7100);	// @ (0xE20 * 8 + 0)
#define                                 SSPCLKPPS0_bit      _BIT_ACCESS(SSPCLKPPS,0)
// SSPCLKPPS<SSPCLKPPS1>
extern volatile __bit                   SSPCLKPPS1          __at(0x7101);	// @ (0xE20 * 8 + 1)
#define                                 SSPCLKPPS1_bit      _BIT_ACCESS(SSPCLKPPS,1)
// SSPCLKPPS<SSPCLKPPS2>
extern volatile __bit                   SSPCLKPPS2          __at(0x7102);	// @ (0xE20 * 8 + 2)
#define                                 SSPCLKPPS2_bit      _BIT_ACCESS(SSPCLKPPS,2)
// SSPCLKPPS<SSPCLKPPS3>
extern volatile __bit                   SSPCLKPPS3          __at(0x7103);	// @ (0xE20 * 8 + 3)
#define                                 SSPCLKPPS3_bit      _BIT_ACCESS(SSPCLKPPS,3)
// SSPCLKPPS<SSPCLKPPS4>
extern volatile __bit                   SSPCLKPPS4          __at(0x7104);	// @ (0xE20 * 8 + 4)
#define                                 SSPCLKPPS4_bit      _BIT_ACCESS(SSPCLKPPS,4)
// SSPDATPPS<SSPDATPPS0>
extern volatile __bit                   SSPDATPPS0          __at(0x7108);	// @ (0xE21 * 8 + 0)
#define                                 SSPDATPPS0_bit      _BIT_ACCESS(SSPDATPPS,0)
// SSPDATPPS<SSPDATPPS1>
extern volatile __bit                   SSPDATPPS1          __at(0x7109);	// @ (0xE21 * 8 + 1)
#define                                 SSPDATPPS1_bit      _BIT_ACCESS(SSPDATPPS,1)
// SSPDATPPS<SSPDATPPS2>
extern volatile __bit                   SSPDATPPS2          __at(0x710A);	// @ (0xE21 * 8 + 2)
#define                                 SSPDATPPS2_bit      _BIT_ACCESS(SSPDATPPS,2)
// SSPDATPPS<SSPDATPPS3>
extern volatile __bit                   SSPDATPPS3          __at(0x710B);	// @ (0xE21 * 8 + 3)
#define                                 SSPDATPPS3_bit      _BIT_ACCESS(SSPDATPPS,3)
// SSPDATPPS<SSPDATPPS4>
extern volatile __bit                   SSPDATPPS4          __at(0x710C);	// @ (0xE21 * 8 + 4)
#define                                 SSPDATPPS4_bit      _BIT_ACCESS(SSPDATPPS,4)
// SSP1CON1<SSPEN>
extern volatile __bit                   SSPEN               __at(0x10AD);	// @ (0x215 * 8 + 5)
#define                                 SSPEN_bit           _BIT_ACCESS(SSP1CON1,5)
// SSP1CON1<SSPM0>
extern volatile __bit                   SSPM0               __at(0x10A8);	// @ (0x215 * 8 + 0)
#define                                 SSPM0_bit           _BIT_ACCESS(SSP1CON1,0)
// SSP1CON1<SSPM1>
extern volatile __bit                   SSPM1               __at(0x10A9);	// @ (0x215 * 8 + 1)
#define                                 SSPM1_bit           _BIT_ACCESS(SSP1CON1,1)
// SSP1CON1<SSPM2>
extern volatile __bit                   SSPM2               __at(0x10AA);	// @ (0x215 * 8 + 2)
#define                                 SSPM2_bit           _BIT_ACCESS(SSP1CON1,2)
// SSP1CON1<SSPM3>
extern volatile __bit                   SSPM3               __at(0x10AB);	// @ (0x215 * 8 + 3)
#define                                 SSPM3_bit           _BIT_ACCESS(SSP1CON1,3)
// SSP1CON1<SSPOV>
extern volatile __bit                   SSPOV               __at(0x10AE);	// @ (0x215 * 8 + 6)
#define                                 SSPOV_bit           _BIT_ACCESS(SSP1CON1,6)
// SSPSSPPS<SSPSSPPS0>
extern volatile __bit                   SSPSSPPS0           __at(0x7110);	// @ (0xE22 * 8 + 0)
#define                                 SSPSSPPS0_bit       _BIT_ACCESS(SSPSSPPS,0)
// SSPSSPPS<SSPSSPPS1>
extern volatile __bit                   SSPSSPPS1           __at(0x7111);	// @ (0xE22 * 8 + 1)
#define                                 SSPSSPPS1_bit       _BIT_ACCESS(SSPSSPPS,1)
// SSPSSPPS<SSPSSPPS2>
extern volatile __bit                   SSPSSPPS2           __at(0x7112);	// @ (0xE22 * 8 + 2)
#define                                 SSPSSPPS2_bit       _BIT_ACCESS(SSPSSPPS,2)
// SSPSSPPS<SSPSSPPS3>
extern volatile __bit                   SSPSSPPS3           __at(0x7113);	// @ (0xE22 * 8 + 3)
#define                                 SSPSSPPS3_bit       _BIT_ACCESS(SSPSSPPS,3)
// SSPSSPPS<SSPSSPPS4>
extern volatile __bit                   SSPSSPPS4           __at(0x7114);	// @ (0xE22 * 8 + 4)
#define                                 SSPSSPPS4_bit       _BIT_ACCESS(SSPSSPPS,4)
// WDTTMR<STATE>
extern volatile __bit                   STATE               __at(0x38AA);	// @ (0x715 * 8 + 2)
#define                                 STATE_bit           _BIT_ACCESS(WDTTMR,2)
// PCON<STKOVF>
extern volatile __bit                   STKOVF              __at(0x4B7);	// @ (0x96 * 8 + 7)
#define                                 STKOVF_bit          _BIT_ACCESS(PCON,7)
// PCON<STKUNF>
extern volatile __bit                   STKUNF              __at(0x4B6);	// @ (0x96 * 8 + 6)
#define                                 STKUNF_bit          _BIT_ACCESS(PCON,6)
// AT1STPTL<STPT0>
extern volatile __bit                   STPT0               __at(0x40D0);	// @ (0x81A * 8 + 0)
#define                                 STPT0_bit           _BIT_ACCESS(AT1STPTL,0)
// AT1STPTL<STPT1>
extern volatile __bit                   STPT1               __at(0x40D1);	// @ (0x81A * 8 + 1)
#define                                 STPT1_bit           _BIT_ACCESS(AT1STPTL,1)
// AT1STPTH<STPT10>
extern volatile __bit                   STPT10              __at(0x40DA);	// @ (0x81B * 8 + 2)
#define                                 STPT10_bit          _BIT_ACCESS(AT1STPTH,2)
// AT1STPTH<STPT11>
extern volatile __bit                   STPT11              __at(0x40DB);	// @ (0x81B * 8 + 3)
#define                                 STPT11_bit          _BIT_ACCESS(AT1STPTH,3)
// AT1STPTH<STPT12>
extern volatile __bit                   STPT12              __at(0x40DC);	// @ (0x81B * 8 + 4)
#define                                 STPT12_bit          _BIT_ACCESS(AT1STPTH,4)
// AT1STPTH<STPT13>
extern volatile __bit                   STPT13              __at(0x40DD);	// @ (0x81B * 8 + 5)
#define                                 STPT13_bit          _BIT_ACCESS(AT1STPTH,5)
// AT1STPTH<STPT14>
extern volatile __bit                   STPT14              __at(0x40DE);	// @ (0x81B * 8 + 6)
#define                                 STPT14_bit          _BIT_ACCESS(AT1STPTH,6)
// AT1STPTL<STPT2>
extern volatile __bit                   STPT2               __at(0x40D2);	// @ (0x81A * 8 + 2)
#define                                 STPT2_bit           _BIT_ACCESS(AT1STPTL,2)
// AT1STPTL<STPT3>
extern volatile __bit                   STPT3               __at(0x40D3);	// @ (0x81A * 8 + 3)
#define                                 STPT3_bit           _BIT_ACCESS(AT1STPTL,3)
// AT1STPTL<STPT4>
extern volatile __bit                   STPT4               __at(0x40D4);	// @ (0x81A * 8 + 4)
#define                                 STPT4_bit           _BIT_ACCESS(AT1STPTL,4)
// AT1STPTL<STPT5>
extern volatile __bit                   STPT5               __at(0x40D5);	// @ (0x81A * 8 + 5)
#define                                 STPT5_bit           _BIT_ACCESS(AT1STPTL,5)
// AT1STPTL<STPT6>
extern volatile __bit                   STPT6               __at(0x40D6);	// @ (0x81A * 8 + 6)
#define                                 STPT6_bit           _BIT_ACCESS(AT1STPTL,6)
// AT1STPTL<STPT7>
extern volatile __bit                   STPT7               __at(0x40D7);	// @ (0x81A * 8 + 7)
#define                                 STPT7_bit           _BIT_ACCESS(AT1STPTL,7)
// AT1STPTH<STPT8>
extern volatile __bit                   STPT8               __at(0x40D8);	// @ (0x81B * 8 + 0)
#define                                 STPT8_bit           _BIT_ACCESS(AT1STPTH,0)
// AT1STPTH<STPT9>
extern volatile __bit                   STPT9               __at(0x40D9);	// @ (0x81B * 8 + 1)
#define                                 STPT9_bit           _BIT_ACCESS(AT1STPTH,1)
// CWG1OCON0<STRA>
extern volatile __bit                   STRA                __at(0x34A8);	// @ (0x695 * 8 + 0)
#define                                 STRA_bit            _BIT_ACCESS(CWG1OCON0,0)
// CWG1OCON0<STRB>
extern volatile __bit                   STRB                __at(0x34A9);	// @ (0x695 * 8 + 1)
#define                                 STRB_bit            _BIT_ACCESS(CWG1OCON0,1)
// CWG1OCON0<STRC>
extern volatile __bit                   STRC                __at(0x34AA);	// @ (0x695 * 8 + 2)
#define                                 STRC_bit            _BIT_ACCESS(CWG1OCON0,2)
// CWG1OCON0<STRD>
extern volatile __bit                   STRD                __at(0x34AB);	// @ (0x695 * 8 + 3)
#define                                 STRD_bit            _BIT_ACCESS(CWG1OCON0,3)
// WDTCON0<SWDTEN>
extern volatile __bit                   SWDTEN              __at(0x3888);	// @ (0x711 * 8 + 0)
#define                                 SWDTEN_bit          _BIT_ACCESS(WDTCON0,0)
// TX1STA<SYNC>
extern volatile __bit                   SYNC                __at(0xCF4);	// @ (0x19E * 8 + 4)
#define                                 SYNC_bit            _BIT_ACCESS(TX1STA,4)
// T0CKIPPS<T0CKIPPS0>
extern volatile __bit                   T0CKIPPS0           __at(0x7088);	// @ (0xE11 * 8 + 0)
#define                                 T0CKIPPS0_bit       _BIT_ACCESS(T0CKIPPS,0)
// T0CKIPPS<T0CKIPPS1>
extern volatile __bit                   T0CKIPPS1           __at(0x7089);	// @ (0xE11 * 8 + 1)
#define                                 T0CKIPPS1_bit       _BIT_ACCESS(T0CKIPPS,1)
// T0CKIPPS<T0CKIPPS2>
extern volatile __bit                   T0CKIPPS2           __at(0x708A);	// @ (0xE11 * 8 + 2)
#define                                 T0CKIPPS2_bit       _BIT_ACCESS(T0CKIPPS,2)
// T0CKIPPS<T0CKIPPS3>
extern volatile __bit                   T0CKIPPS3           __at(0x708B);	// @ (0xE11 * 8 + 3)
#define                                 T0CKIPPS3_bit       _BIT_ACCESS(T0CKIPPS,3)
// T0CKIPPS<T0CKIPPS4>
extern volatile __bit                   T0CKIPPS4           __at(0x708C);	// @ (0xE11 * 8 + 4)
#define                                 T0CKIPPS4_bit       _BIT_ACCESS(T0CKIPPS,4)
// OPTION_REG<T0CS>
extern volatile __bit                   T0CS                __at(0x4AD);	// @ (0x95 * 8 + 5)
#define                                 T0CS_bit            _BIT_ACCESS(OPTION_REG,5)
// INTCON<T0IE>
extern volatile __bit                   T0IE                __at(0x5D);	// @ (0xB * 8 + 5)
#define                                 T0IE_bit            _BIT_ACCESS(INTCON,5)
// INTCON<T0IF>
extern volatile __bit                   T0IF                __at(0x5A);	// @ (0xB * 8 + 2)
#define                                 T0IF_bit            _BIT_ACCESS(INTCON,2)
// OPTION_REG<T0SE>
extern volatile __bit                   T0SE                __at(0x4AC);	// @ (0x95 * 8 + 4)
#define                                 T0SE_bit            _BIT_ACCESS(OPTION_REG,4)
// T1CKIPPS<T1CKIPPS0>
extern volatile __bit                   T1CKIPPS0           __at(0x7090);	// @ (0xE12 * 8 + 0)
#define                                 T1CKIPPS0_bit       _BIT_ACCESS(T1CKIPPS,0)
// T1CKIPPS<T1CKIPPS1>
extern volatile __bit                   T1CKIPPS1           __at(0x7091);	// @ (0xE12 * 8 + 1)
#define                                 T1CKIPPS1_bit       _BIT_ACCESS(T1CKIPPS,1)
// T1CKIPPS<T1CKIPPS2>
extern volatile __bit                   T1CKIPPS2           __at(0x7092);	// @ (0xE12 * 8 + 2)
#define                                 T1CKIPPS2_bit       _BIT_ACCESS(T1CKIPPS,2)
// T1CKIPPS<T1CKIPPS3>
extern volatile __bit                   T1CKIPPS3           __at(0x7093);	// @ (0xE12 * 8 + 3)
#define                                 T1CKIPPS3_bit       _BIT_ACCESS(T1CKIPPS,3)
// T1CKIPPS<T1CKIPPS4>
extern volatile __bit                   T1CKIPPS4           __at(0x7094);	// @ (0xE12 * 8 + 4)
#define                                 T1CKIPPS4_bit       _BIT_ACCESS(T1CKIPPS,4)
// T1CON<T1CKPS0>
extern volatile __bit                   T1CKPS0             __at(0xC4);	// @ (0x18 * 8 + 4)
#define                                 T1CKPS0_bit         _BIT_ACCESS(T1CON,4)
// T1CON<T1CKPS1>
extern volatile __bit                   T1CKPS1             __at(0xC5);	// @ (0x18 * 8 + 5)
#define                                 T1CKPS1_bit         _BIT_ACCESS(T1CON,5)
// T1GCON<T1GGO_nDONE>
extern volatile __bit                   T1GGO_nDONE         __at(0xCB);	// @ (0x19 * 8 + 3)
#define                                 T1GGO_nDONE_bit     _BIT_ACCESS(T1GCON,3)
// T1GCON<T1GPOL>
extern volatile __bit                   T1GPOL              __at(0xCE);	// @ (0x19 * 8 + 6)
#define                                 T1GPOL_bit          _BIT_ACCESS(T1GCON,6)
// T1GPPS<T1GPPS0>
extern volatile __bit                   T1GPPS0             __at(0x7098);	// @ (0xE13 * 8 + 0)
#define                                 T1GPPS0_bit         _BIT_ACCESS(T1GPPS,0)
// T1GPPS<T1GPPS1>
extern volatile __bit                   T1GPPS1             __at(0x7099);	// @ (0xE13 * 8 + 1)
#define                                 T1GPPS1_bit         _BIT_ACCESS(T1GPPS,1)
// T1GPPS<T1GPPS2>
extern volatile __bit                   T1GPPS2             __at(0x709A);	// @ (0xE13 * 8 + 2)
#define                                 T1GPPS2_bit         _BIT_ACCESS(T1GPPS,2)
// T1GPPS<T1GPPS3>
extern volatile __bit                   T1GPPS3             __at(0x709B);	// @ (0xE13 * 8 + 3)
#define                                 T1GPPS3_bit         _BIT_ACCESS(T1GPPS,3)
// T1GPPS<T1GPPS4>
