MikroElektronika/core_packages/PIC/XC8/def/PIC16F1614/mcu.h
#define                                 WDTPSCNT17_bit      _BIT_ACCESS(WDTTMR,1)
// WDTPSL<WDTPSCNT2>
extern volatile __bit                   WDTPSCNT2           __at(0x389A);	// @ (0x713 * 8 + 2)
#define                                 WDTPSCNT2_bit       _BIT_ACCESS(WDTPSL,2)
// WDTPSL<WDTPSCNT3>
extern volatile __bit                   WDTPSCNT3           __at(0x389B);	// @ (0x713 * 8 + 3)
#define                                 WDTPSCNT3_bit       _BIT_ACCESS(WDTPSL,3)
// WDTPSL<WDTPSCNT4>
extern volatile __bit                   WDTPSCNT4           __at(0x389C);	// @ (0x713 * 8 + 4)
#define                                 WDTPSCNT4_bit       _BIT_ACCESS(WDTPSL,4)
// WDTPSL<WDTPSCNT5>
extern volatile __bit                   WDTPSCNT5           __at(0x389D);	// @ (0x713 * 8 + 5)
#define                                 WDTPSCNT5_bit       _BIT_ACCESS(WDTPSL,5)
// WDTPSL<WDTPSCNT6>
extern volatile __bit                   WDTPSCNT6           __at(0x389E);	// @ (0x713 * 8 + 6)
#define                                 WDTPSCNT6_bit       _BIT_ACCESS(WDTPSL,6)
// WDTPSL<WDTPSCNT7>
extern volatile __bit                   WDTPSCNT7           __at(0x389F);	// @ (0x713 * 8 + 7)
#define                                 WDTPSCNT7_bit       _BIT_ACCESS(WDTPSL,7)
// WDTPSH<WDTPSCNT8>
extern volatile __bit                   WDTPSCNT8           __at(0x38A0);	// @ (0x714 * 8 + 0)
#define                                 WDTPSCNT8_bit       _BIT_ACCESS(WDTPSH,0)
// WDTPSH<WDTPSCNT9>
extern volatile __bit                   WDTPSCNT9           __at(0x38A1);	// @ (0x714 * 8 + 1)
#define                                 WDTPSCNT9_bit       _BIT_ACCESS(WDTPSH,1)
// WDTCON0<WDTSEN>
extern volatile __bit                   WDTSEN              __at(0x3888);	// @ (0x711 * 8 + 0)
#define                                 WDTSEN_bit          _BIT_ACCESS(WDTCON0,0)
// WDTTMR<WDTSTATE>
extern volatile __bit                   WDTSTATE            __at(0x38AA);	// @ (0x715 * 8 + 2)
#define                                 WDTSTATE_bit        _BIT_ACCESS(WDTTMR,2)
// WDTTMR<WDTTMR0>
extern volatile __bit                   WDTTMR0             __at(0x38AB);	// @ (0x715 * 8 + 3)
#define                                 WDTTMR0_bit         _BIT_ACCESS(WDTTMR,3)
// WDTTMR<WDTTMR1>
extern volatile __bit                   WDTTMR1             __at(0x38AC);	// @ (0x715 * 8 + 4)
#define                                 WDTTMR1_bit         _BIT_ACCESS(WDTTMR,4)
// WDTTMR<WDTTMR2>
extern volatile __bit                   WDTTMR2             __at(0x38AD);	// @ (0x715 * 8 + 5)
#define                                 WDTTMR2_bit         _BIT_ACCESS(WDTTMR,5)
// WDTTMR<WDTTMR3>
extern volatile __bit                   WDTTMR3             __at(0x38AE);	// @ (0x715 * 8 + 6)
#define                                 WDTTMR3_bit         _BIT_ACCESS(WDTTMR,6)
// WDTTMR<WDTTMR4>
extern volatile __bit                   WDTTMR4             __at(0x38AF);	// @ (0x715 * 8 + 7)
#define                                 WDTTMR4_bit         _BIT_ACCESS(WDTTMR,7)
// WDTCON1<WDTWINDOW0>
extern volatile __bit                   WDTWINDOW0          __at(0x3890);	// @ (0x712 * 8 + 0)
#define                                 WDTWINDOW0_bit      _BIT_ACCESS(WDTCON1,0)
// WDTCON1<WDTWINDOW1>
extern volatile __bit                   WDTWINDOW1          __at(0x3891);	// @ (0x712 * 8 + 1)
#define                                 WDTWINDOW1_bit      _BIT_ACCESS(WDTCON1,1)
// WDTCON1<WDTWINDOW2>
extern volatile __bit                   WDTWINDOW2          __at(0x3892);	// @ (0x712 * 8 + 2)
#define                                 WDTWINDOW2_bit      _BIT_ACCESS(WDTCON1,2)
// WDTCON1<WINDOW0>
extern volatile __bit                   WINDOW0             __at(0x3890);	// @ (0x712 * 8 + 0)
#define                                 WINDOW0_bit         _BIT_ACCESS(WDTCON1,0)
// WDTCON1<WINDOW1>
extern volatile __bit                   WINDOW1             __at(0x3891);	// @ (0x712 * 8 + 1)
#define                                 WINDOW1_bit         _BIT_ACCESS(WDTCON1,1)
// WDTCON1<WINDOW2>
extern volatile __bit                   WINDOW2             __at(0x3892);	// @ (0x712 * 8 + 2)
#define                                 WINDOW2_bit         _BIT_ACCESS(WDTCON1,2)
// WPUA<WPUA0>
extern volatile __bit                   WPUA0               __at(0x1060);	// @ (0x20C * 8 + 0)
#define                                 WPUA0_bit           _BIT_ACCESS(WPUA,0)
// WPUA<WPUA1>
extern volatile __bit                   WPUA1               __at(0x1061);	// @ (0x20C * 8 + 1)
#define                                 WPUA1_bit           _BIT_ACCESS(WPUA,1)
// WPUA<WPUA2>
extern volatile __bit                   WPUA2               __at(0x1062);	// @ (0x20C * 8 + 2)
#define                                 WPUA2_bit           _BIT_ACCESS(WPUA,2)
// WPUA<WPUA3>
extern volatile __bit                   WPUA3               __at(0x1063);	// @ (0x20C * 8 + 3)
#define                                 WPUA3_bit           _BIT_ACCESS(WPUA,3)
// WPUA<WPUA4>
extern volatile __bit                   WPUA4               __at(0x1064);	// @ (0x20C * 8 + 4)
#define                                 WPUA4_bit           _BIT_ACCESS(WPUA,4)
// WPUA<WPUA5>
extern volatile __bit                   WPUA5               __at(0x1065);	// @ (0x20C * 8 + 5)
#define                                 WPUA5_bit           _BIT_ACCESS(WPUA,5)
// WPUC<WPUC0>
extern volatile __bit                   WPUC0               __at(0x1070);	// @ (0x20E * 8 + 0)
#define                                 WPUC0_bit           _BIT_ACCESS(WPUC,0)
// WPUC<WPUC1>
extern volatile __bit                   WPUC1               __at(0x1071);	// @ (0x20E * 8 + 1)
#define                                 WPUC1_bit           _BIT_ACCESS(WPUC,1)
// WPUC<WPUC2>
extern volatile __bit                   WPUC2               __at(0x1072);	// @ (0x20E * 8 + 2)
#define                                 WPUC2_bit           _BIT_ACCESS(WPUC,2)
// WPUC<WPUC3>
extern volatile __bit                   WPUC3               __at(0x1073);	// @ (0x20E * 8 + 3)
#define                                 WPUC3_bit           _BIT_ACCESS(WPUC,3)
// WPUC<WPUC4>
extern volatile __bit                   WPUC4               __at(0x1074);	// @ (0x20E * 8 + 4)
#define                                 WPUC4_bit           _BIT_ACCESS(WPUC,4)
// WPUC<WPUC5>
extern volatile __bit                   WPUC5               __at(0x1075);	// @ (0x20E * 8 + 5)
#define                                 WPUC5_bit           _BIT_ACCESS(WPUC,5)
// PMCON1<WR>
extern volatile __bit                   WR                  __at(0xCA9);	// @ (0x195 * 8 + 1)
#define                                 WR_bit              _BIT_ACCESS(PMCON1,1)
// PMCON1<WREN>
extern volatile __bit                   WREN                __at(0xCAA);	// @ (0x195 * 8 + 2)
#define                                 WREN_bit            _BIT_ACCESS(PMCON1,2)
// PMCON1<WRERR>
extern volatile __bit                   WRERR               __at(0xCAB);	// @ (0x195 * 8 + 3)
#define                                 WRERR_bit           _BIT_ACCESS(PMCON1,3)
// BAUD1CON<WUE>
extern volatile __bit                   WUE                 __at(0xCF9);	// @ (0x19F * 8 + 1)
#define                                 WUE_bit             _BIT_ACCESS(BAUD1CON,1)
// CRCXORL<XOR1>
extern volatile __bit                   XOR1                __at(0x3CB9);	// @ (0x797 * 8 + 1)
#define                                 XOR1_bit            _BIT_ACCESS(CRCXORL,1)
// CRCXORH<XOR10>
extern volatile __bit                   XOR10               __at(0x3CC2);	// @ (0x798 * 8 + 2)
#define                                 XOR10_bit           _BIT_ACCESS(CRCXORH,2)
// CRCXORH<XOR11>
extern volatile __bit                   XOR11               __at(0x3CC3);	// @ (0x798 * 8 + 3)
#define                                 XOR11_bit           _BIT_ACCESS(CRCXORH,3)
// CRCXORH<XOR12>
extern volatile __bit                   XOR12               __at(0x3CC4);	// @ (0x798 * 8 + 4)
#define                                 XOR12_bit           _BIT_ACCESS(CRCXORH,4)
// CRCXORH<XOR13>
extern volatile __bit                   XOR13               __at(0x3CC5);	// @ (0x798 * 8 + 5)
#define                                 XOR13_bit           _BIT_ACCESS(CRCXORH,5)
// CRCXORH<XOR14>
extern volatile __bit                   XOR14               __at(0x3CC6);	// @ (0x798 * 8 + 6)
#define                                 XOR14_bit           _BIT_ACCESS(CRCXORH,6)
// CRCXORH<XOR15>
extern volatile __bit                   XOR15               __at(0x3CC7);	// @ (0x798 * 8 + 7)
#define                                 XOR15_bit           _BIT_ACCESS(CRCXORH,7)
// CRCXORL<XOR2>
extern volatile __bit                   XOR2                __at(0x3CBA);	// @ (0x797 * 8 + 2)
#define                                 XOR2_bit            _BIT_ACCESS(CRCXORL,2)
// CRCXORL<XOR3>
extern volatile __bit                   XOR3                __at(0x3CBB);	// @ (0x797 * 8 + 3)
#define                                 XOR3_bit            _BIT_ACCESS(CRCXORL,3)
// CRCXORL<XOR4>
extern volatile __bit                   XOR4                __at(0x3CBC);	// @ (0x797 * 8 + 4)
#define                                 XOR4_bit            _BIT_ACCESS(CRCXORL,4)
// CRCXORL<XOR5>
extern volatile __bit                   XOR5                __at(0x3CBD);	// @ (0x797 * 8 + 5)
#define                                 XOR5_bit            _BIT_ACCESS(CRCXORL,5)
// CRCXORL<XOR6>
extern volatile __bit                   XOR6                __at(0x3CBE);	// @ (0x797 * 8 + 6)
#define                                 XOR6_bit            _BIT_ACCESS(CRCXORL,6)
// CRCXORL<XOR7>
extern volatile __bit                   XOR7                __at(0x3CBF);	// @ (0x797 * 8 + 7)
#define                                 XOR7_bit            _BIT_ACCESS(CRCXORL,7)
// CRCXORH<XOR8>
extern volatile __bit                   XOR8                __at(0x3CC0);	// @ (0x798 * 8 + 0)
#define                                 XOR8_bit            _BIT_ACCESS(CRCXORH,0)
// CRCXORH<XOR9>
extern volatile __bit                   XOR9                __at(0x3CC1);	// @ (0x798 * 8 + 1)
#define                                 XOR9_bit            _BIT_ACCESS(CRCXORH,1)
// PID1Z1L<Z10>
extern volatile __bit                   Z10                 __at(0x2CD8);	// @ (0x59B * 8 + 0)
#define                                 Z10_bit             _BIT_ACCESS(PID1Z1L,0)
// PID1Z1L<Z11>
extern volatile __bit                   Z11                 __at(0x2CD9);	// @ (0x59B * 8 + 1)
#define                                 Z11_bit             _BIT_ACCESS(PID1Z1L,1)
// PID1Z1H<Z110>
extern volatile __bit                   Z110                __at(0x2CE2);	// @ (0x59C * 8 + 2)
#define                                 Z110_bit            _BIT_ACCESS(PID1Z1H,2)
// PID1Z1H<Z111>
extern volatile __bit                   Z111                __at(0x2CE3);	// @ (0x59C * 8 + 3)
#define                                 Z111_bit            _BIT_ACCESS(PID1Z1H,3)
// PID1Z1H<Z112>
extern volatile __bit                   Z112                __at(0x2CE4);	// @ (0x59C * 8 + 4)
#define                                 Z112_bit            _BIT_ACCESS(PID1Z1H,4)
// PID1Z1H<Z113>
extern volatile __bit                   Z113                __at(0x2CE5);	// @ (0x59C * 8 + 5)
#define                                 Z113_bit            _BIT_ACCESS(PID1Z1H,5)
// PID1Z1H<Z114>
extern volatile __bit                   Z114                __at(0x2CE6);	// @ (0x59C * 8 + 6)
#define                                 Z114_bit            _BIT_ACCESS(PID1Z1H,6)
// PID1Z1H<Z115>
extern volatile __bit                   Z115                __at(0x2CE7);	// @ (0x59C * 8 + 7)
#define                                 Z115_bit            _BIT_ACCESS(PID1Z1H,7)
// PID1Z1U<Z116>
extern volatile __bit                   Z116                __at(0x2CE8);	// @ (0x59D * 8 + 0)
#define                                 Z116_bit            _BIT_ACCESS(PID1Z1U,0)
// PID1Z1L<Z12>
extern volatile __bit                   Z12                 __at(0x2CDA);	// @ (0x59B * 8 + 2)
#define                                 Z12_bit             _BIT_ACCESS(PID1Z1L,2)
// PID1Z1L<Z13>
extern volatile __bit                   Z13                 __at(0x2CDB);	// @ (0x59B * 8 + 3)
#define                                 Z13_bit             _BIT_ACCESS(PID1Z1L,3)
// PID1Z1L<Z14>
extern volatile __bit                   Z14                 __at(0x2CDC);	// @ (0x59B * 8 + 4)
#define                                 Z14_bit             _BIT_ACCESS(PID1Z1L,4)
// PID1Z1L<Z15>
extern volatile __bit                   Z15                 __at(0x2CDD);	// @ (0x59B * 8 + 5)
#define                                 Z15_bit             _BIT_ACCESS(PID1Z1L,5)
// PID1Z1L<Z16>
extern volatile __bit                   Z16                 __at(0x2CDE);	// @ (0x59B * 8 + 6)
#define                                 Z16_bit             _BIT_ACCESS(PID1Z1L,6)
// PID1Z1L<Z17>
extern volatile __bit                   Z17                 __at(0x2CDF);	// @ (0x59B * 8 + 7)
#define                                 Z17_bit             _BIT_ACCESS(PID1Z1L,7)
// PID1Z1H<Z18>
extern volatile __bit                   Z18                 __at(0x2CE0);	// @ (0x59C * 8 + 0)
#define                                 Z18_bit             _BIT_ACCESS(PID1Z1H,0)
// PID1Z1H<Z19>
extern volatile __bit                   Z19                 __at(0x2CE1);	// @ (0x59C * 8 + 1)
#define                                 Z19_bit             _BIT_ACCESS(PID1Z1H,1)
// PID1Z2L<Z20>
extern volatile __bit                   Z20                 __at(0x3060);	// @ (0x60C * 8 + 0)
#define                                 Z20_bit             _BIT_ACCESS(PID1Z2L,0)
// PID1Z2L<Z21>
extern volatile __bit                   Z21                 __at(0x3061);	// @ (0x60C * 8 + 1)
#define                                 Z21_bit             _BIT_ACCESS(PID1Z2L,1)
// PID1Z2H<Z210>
extern volatile __bit                   Z210                __at(0x306A);	// @ (0x60D * 8 + 2)
#define                                 Z210_bit            _BIT_ACCESS(PID1Z2H,2)
// PID1Z2H<Z211>
extern volatile __bit                   Z211                __at(0x306B);	// @ (0x60D * 8 + 3)
#define                                 Z211_bit            _BIT_ACCESS(PID1Z2H,3)
// PID1Z2H<Z212>
extern volatile __bit                   Z212                __at(0x306C);	// @ (0x60D * 8 + 4)
#define                                 Z212_bit            _BIT_ACCESS(PID1Z2H,4)
// PID1Z2H<Z213>
extern volatile __bit                   Z213                __at(0x306D);	// @ (0x60D * 8 + 5)
#define                                 Z213_bit            _BIT_ACCESS(PID1Z2H,5)
// PID1Z2H<Z214>
extern volatile __bit                   Z214                __at(0x306E);	// @ (0x60D * 8 + 6)
#define                                 Z214_bit            _BIT_ACCESS(PID1Z2H,6)
// PID1Z2H<Z215>
extern volatile __bit                   Z215                __at(0x306F);	// @ (0x60D * 8 + 7)
#define                                 Z215_bit            _BIT_ACCESS(PID1Z2H,7)
// PID1Z2U<Z216>
extern volatile __bit                   Z216                __at(0x3070);	// @ (0x60E * 8 + 0)
#define                                 Z216_bit            _BIT_ACCESS(PID1Z2U,0)
// PID1Z2L<Z22>
extern volatile __bit                   Z22                 __at(0x3062);	// @ (0x60C * 8 + 2)
#define                                 Z22_bit             _BIT_ACCESS(PID1Z2L,2)
// PID1Z2L<Z23>
extern volatile __bit                   Z23                 __at(0x3063);	// @ (0x60C * 8 + 3)
#define                                 Z23_bit             _BIT_ACCESS(PID1Z2L,3)
// PID1Z2L<Z24>
extern volatile __bit                   Z24                 __at(0x3064);	// @ (0x60C * 8 + 4)
#define                                 Z24_bit             _BIT_ACCESS(PID1Z2L,4)
// PID1Z2L<Z25>
extern volatile __bit                   Z25                 __at(0x3065);	// @ (0x60C * 8 + 5)
#define                                 Z25_bit             _BIT_ACCESS(PID1Z2L,5)
// PID1Z2L<Z26>
extern volatile __bit                   Z26                 __at(0x3066);	// @ (0x60C * 8 + 6)
#define                                 Z26_bit             _BIT_ACCESS(PID1Z2L,6)
// PID1Z2L<Z27>
extern volatile __bit                   Z27                 __at(0x3067);	// @ (0x60C * 8 + 7)
#define                                 Z27_bit             _BIT_ACCESS(PID1Z2L,7)
// PID1Z2H<Z28>
extern volatile __bit                   Z28                 __at(0x3068);	// @ (0x60D * 8 + 0)
#define                                 Z28_bit             _BIT_ACCESS(PID1Z2H,0)
// PID1Z2H<Z29>
extern volatile __bit                   Z29                 __at(0x3069);	// @ (0x60D * 8 + 1)
#define                                 Z29_bit             _BIT_ACCESS(PID1Z2H,1)
// ZCD1CON<ZCD1EN>
extern volatile __bit                   ZCD1EN              __at(0x8E7);	// @ (0x11C * 8 + 7)
#define                                 ZCD1EN_bit          _BIT_ACCESS(ZCD1CON,7)
// ZCD1CON<ZCD1INTN>
extern volatile __bit                   ZCD1INTN            __at(0x8E0);	// @ (0x11C * 8 + 0)
#define                                 ZCD1INTN_bit        _BIT_ACCESS(ZCD1CON,0)
// ZCD1CON<ZCD1INTP>
extern volatile __bit                   ZCD1INTP            __at(0x8E1);	// @ (0x11C * 8 + 1)
#define                                 ZCD1INTP_bit        _BIT_ACCESS(ZCD1CON,1)
// ZCD1CON<ZCD1OUT>
extern volatile __bit                   ZCD1OUT             __at(0x8E5);	// @ (0x11C * 8 + 5)
#define                                 ZCD1OUT_bit         _BIT_ACCESS(ZCD1CON,5)
// ZCD1CON<ZCD1POL>
extern volatile __bit                   ZCD1POL             __at(0x8E4);	// @ (0x11C * 8 + 4)
#define                                 ZCD1POL_bit         _BIT_ACCESS(ZCD1CON,4)
// PIE3<ZCDIE>
extern volatile __bit                   ZCDIE               __at(0x494);	// @ (0x92 * 8 + 4)
#define                                 ZCDIE_bit           _BIT_ACCESS(PIE3,4)
// PIR3<ZCDIF>
extern volatile __bit                   ZCDIF               __at(0x94);	// @ (0x12 * 8 + 4)
#define                                 ZCDIF_bit           _BIT_ACCESS(PIR3,4)
// STATUS<ZERO>
extern volatile __bit                   ZERO                __at(0x1A);	// @ (0x3 * 8 + 2)
#define                                 ZERO_bit            _BIT_ACCESS(STATUS,2)
// STATUS_SHAD<Z_SHAD>
extern volatile __bit                   Z_SHAD              __at(0x7F22);	// @ (0xFE4 * 8 + 2)
#define                                 Z_SHAD_bit          _BIT_ACCESS(STATUS_SHAD,2)
// PCON<nBOR>
extern volatile __bit                   nBOR                __at(0x4B0);	// @ (0x96 * 8 + 0)
#define                                 nBOR_bit            _BIT_ACCESS(PCON,0)
// STATUS<nPD>
extern volatile __bit                   nPD                 __at(0x1B);	// @ (0x3 * 8 + 3)
#define                                 nPD_bit             _BIT_ACCESS(STATUS,3)
// PCON<nPOR>
extern volatile __bit                   nPOR                __at(0x4B1);	// @ (0x96 * 8 + 1)
#define                                 nPOR_bit            _BIT_ACCESS(PCON,1)
// PCON<nRI>
extern volatile __bit                   nRI                 __at(0x4B2);	// @ (0x96 * 8 + 2)
#define                                 nRI_bit             _BIT_ACCESS(PCON,2)
// PCON<nRMCLR>
extern volatile __bit                   nRMCLR              __at(0x4B3);	// @ (0x96 * 8 + 3)
#define                                 nRMCLR_bit          _BIT_ACCESS(PCON,3)
// PCON<nRWDT>
extern volatile __bit                   nRWDT               __at(0x4B4);	// @ (0x96 * 8 + 4)
#define                                 nRWDT_bit           _BIT_ACCESS(PCON,4)
// T1CON<nT1SYNC>
extern volatile __bit                   nT1SYNC             __at(0xC2);	// @ (0x18 * 8 + 2)
#define                                 nT1SYNC_bit         _BIT_ACCESS(T1CON,2)
// STATUS<nTO>
extern volatile __bit                   nTO                 __at(0x1C);	// @ (0x3 * 8 + 4)
#define                                 nTO_bit             _BIT_ACCESS(STATUS,4)
// PCON<nWDTWV>
extern volatile __bit                   nWDTWV              __at(0x4B5);	// @ (0x96 * 8 + 5)
#define                                 nWDTWV_bit          _BIT_ACCESS(PCON,5)
// OPTION_REG<nWPUEN>
extern volatile __bit                   nWPUEN              __at(0x4AF);	// @ (0x95 * 8 + 7)
#define                                 nWPUEN_bit          _BIT_ACCESS(OPTION_REG,7)

#endif // _PIC16F1614_H_
